Updated solutions readme
